ExprovipFuel/src/Documents/ФактураШаблон/ФактураШаблон.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ФактураШаблон</name>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаПоставщика</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПапкаЗаправок</name>
    <type>
      <types>CatalogRef.МестаТранзакции</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор77</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Транзакции</name>
    <attributes>
      <name>ДатаТранзакции</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Карта</name>
      <type>
        <types>CatalogRef.Карточки</types>
      </type>
    </attributes>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Автомобиль</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоТранзакции</name>
      <type>
        <types>CatalogRef.МестаТранзакции</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаТекст</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ошибки</name>
    <attributes>
      <name>ТекстОшибки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ExprovipFuel/src/Documents/Фактура/Фактура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Фактура</name>
  <attributes>
    <name>ПоследнийНомерПечати</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>флагСчитатьСкидкуОтМестаТранзакции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗаДороги</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсЗаДороги</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор77</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Транзакции</name>
    <attributes>
      <name>ДатаТранзакции</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Карта</name>
      <type>
        <types>CatalogRef.Карточки</types>
      </type>
    </attributes>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Автомобиль</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоТранзакции</name>
      <type>
        <types>CatalogRef.МестаТранзакции</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСоСкидкой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Итого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютнаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Надбавка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютнаяЦенаСНадбавкой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.ФактураШаблон</types>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаПоставщика</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ФлагНеУчитывать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ExprovipFuel/src/Catalogs/Настройки/Настройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Настройки</name>
  <predefined>
    <items>
      <name>ПредопределенныеНастройки</name>
      <description>Предопределенные настройки</description>
    </items>
  </predefined>
  <attributes>
    <name>EUR</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>USD</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>RUB</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>BYN</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьДляВыгрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьДляВыгрузкиИнвойсов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

ExprovipFuel/src/Documents/ФактураШаблон/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	СтруктураФактуры = ПолучитьФактуру();
	Если Не СтруктураФактуры.Результат Тогда
		Отказ = Истина;
		//@skip-check undefined-variable
		ОбщегоНазначения.СообщитьПользователю(СтруктураФактуры.Ошибка);
		Возврат;
	КонецЕсли;
	СтруктураНастроек = Справочники.Настройки.ПолучитьНастройки();
	ФактураОбъект = СтруктураФактуры.ФактураСсылка.ПолучитьОбъект();
	СтруктураПоиска = Новый Структура();
	СтруктураПоиска.Вставить("ДокументОснование", Ссылка);
	СтруктураПоиска.Вставить("ЭтапОплаты", 0);
	
	МассивСтрокПоиска = ФактураОбъект.Транзакции.НайтиСтроки(СтруктураПоиска);
	Для Каждого ЭлементМассива Из МассивСтрокПоиска Цикл
		ФактураОбъект.Транзакции.Удалить(ЭлементМассива);	
	КонецЦикла;	
	
	Для Каждого СтрокаТЧ Из Транзакции Цикл
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ДатаТранзакции", СтрокаТЧ.ДатаТранзакции);
		СтруктураПоиска.Вставить("Карта", СтрокаТЧ.Карта);
		СтруктураПоиска.Вставить("Клиент", СтрокаТЧ.Клиент);
		СтруктураПоиска.Вставить("Автомобиль", СтрокаТЧ.Автомобиль);
		СтруктураПоиска.Вставить("Количество", СтрокаТЧ.Количество);
		СтруктураПоиска.Вставить("Цена", СтрокаТЧ.Цена);

		МассивПоиска = ФактураОбъект.Транзакции.НайтиСтроки(СтруктураПоиска);
		Если МассивПоиска.Количество() > 0 Тогда
				//строка уже оплачена. Удалять и изменять ее не будем
			Продолжить;
		КонецЕсли;

		НоваяСтрокаФактуры = ФактураОбъект.Транзакции.Добавить();
		НоваяСтрокаФактуры.ДатаТранзакции = СтрокаТЧ.ДатаТранзакции;
		НоваяСтрокаФактуры.Карта = СтрокаТЧ.Карта;
		НоваяСтрокаФактуры.Клиент = СтрокаТЧ.Клиент;
		НоваяСтрокаФактуры.Автомобиль       = СтрокаТЧ.Автомобиль;
		НоваяСтрокаФактуры.МестоТранзакции  = СтрокаТЧ.МестоТранзакции;
		НоваяСтрокаФактуры.Продукт          = СтрокаТЧ.Продукт;
		НоваяСтрокаФактуры.Количество       = СтрокаТЧ.Количество;
		НоваяСтрокаФактуры.Цена             = СтрокаТЧ.Цена;
		НоваяСтрокаФактуры.Валюта           = СтрокаТЧ.Валюта;
		НоваяСтрокаФактуры.ВалютаПоставщика = ВалютаПоставщика;
		НоваяСтрокаФактуры.Поставщик        = Поставщик;
		НоваяСтрокаФактуры.ДокументОснование = Ссылка;
		Если ВалютаПоставщика = СтруктураНастроек.BYN Тогда
			СтруктураКурса = Справочники.Валюты.ПолучитьСруктуруКурса(ВалютаПоставщика, СтрокаТЧ.ДатаТранзакции);
			Если СтрокаТЧ.Валюта = СтруктураНастроек.EUR Тогда
				КурсБР 					= СтруктураКурса.КурсКЕвро;
			ИначеЕсли СтрокаТЧ.Валюта = СтруктураНастроек.USD Тогда
				КурсБР 					= СтруктураКурса.КурсКДоллару;
			Иначе
				КурсБР 					= СтруктураКурса.КурсКЕвро;
			КонецЕсли;
			НоваяСтрокаФактуры.ВалютнаяЦена 		= СтрокаТЧ.Цена / КурсБР;
			НоваяСтрокаФактуры.ВалютнаяЦенаСНадбавкой = НоваяСтрокаФактуры.ВалютнаяЦена ;
			НоваяСтрокаФактуры.Сумма = НоваяСтрокаФактуры.ВалютнаяЦенаСНадбавкой * НоваяСтрокаФактуры.Количество;
			НоваяСтрокаФактуры.ЦенаСоСкидкой = НоваяСтрокаФактуры.ВалютнаяЦенаСНадбавкой;
			НоваяСтрокаФактуры.Итого  = НоваяСтрокаФактуры.ВалютнаяЦенаСНадбавкой * НоваяСтрокаФактуры.Количество;
		КонецЕсли;
	КонецЦикла;
	ФактураОбъект.Записать();
КонецПроцедуры

// Получить фактуру.
// 
// Возвращаемое значение:
//  Структура - Получить фактуру:
// * Результат - Булево - 
// * ФактураСсылка - ДокументСсылка.Фактура - 
// * Ошибка 
Функция ПолучитьФактуру()
	Структура = Новый Структура;
	Структура.Вставить("Результат", Истина);
	Структура.Вставить("ФактураСсылка", Документы.Фактура.ПустаяСсылка());
	Структура.Вставить("Ошибка");
	
	ФактураСсылка = Документы.Фактура.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
	Запрос.Текст = "ВЫБРАТЬ
	|	Фактура.Ссылка КАК ФактураСсылка
	|ИЗ
	|	Документ.Фактура КАК Фактура
	|ГДЕ
	|	Фактура.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Структура.Результат = Ложь;
		Структура.Ошибка = СтрШаблон("За %1 должна быть создана Фактура", Формат(Дата, "ДФ='MMMM yyyy'"));
		Возврат Структура;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Если Выборка.Количество() <> 1 Тогда
		Структура.Результат = Ложь;
		Структура.Ошибка = СтрШаблон("За %1 должна быть только одна Фактура", Формат(Дата, "ДФ='MMMM yyyy'"));
		Возврат Структура;
	КонецЕсли;
	Выборка.Следующий();
	Структура.ФактураСсылка = Выборка.ФактураСсылка;
	
	Возврат Структура;		
КонецФункции
